#ifndef MAP_FACTORY_HPP
#define MAP_FACTORY_HPP

#include "Map.hpp"

class MapFactory {
public:
    static std::shared_ptr<Map> CreateLevel(int levelId) {
        LevelConfig config;
        config.levelId = levelId;

        if (levelId == 1) {
            config.imagePath = "../PTSD/assets/sprites/images/Map/1.png";
            // 設計 4 條路線
            config.routes = {
                { {-50, 295}, {-44, 102}, {-71, 82}, {-152, 54},{-184, 13},{-203, -24},{-201, -74}, {-170, -112},{-117, -131},{-42, -137},{27, -125},{90, -140},{146, -149},{182, -118},{228, -82},{283, -72},{371, -75},}, // 路線 1
                { {-34, 294}, {-38, 107}, {-52, 79}, {-156, 37}, {-175, 4}, {-183, -40}, {-183, -80}, {-148, -114}, {-91, -129}, {-29, -125}, {36, -114}, {97, -134}, {131, -145}, {162, -127}, {193, -94}, {232, -69}, {279, -61}, {366, -58} }, // 路線 2 (範例)
                { {-11, 305}, {-21, 124}, {-41, 79}, {-147, 39}, {-175, -16}, {-173, -67}, {-151, -99}, {-110, -118}, {-74, -121}, {14, -115}, {51, -112}, {86, -124}, {133, -133}, {169, -113}, {202, -84}, {235, -57}, {309, -51}, {401, -49} },             // 路線 3 (範例)
                { {0, 302}, {-2, 227}, {2, 128}, {-39, 61}, {-147, 17}, {-164, -28}, {-162, -64}, {-139, -101}, {-99, -105}, {-54, -111}, {-4, -108}, {33, -99}, {66, -108}, {98, -117}, {129, -119}, {161, -107}, {192, -79}, {219, -48}, {245, -37}, {297, -36}, {339, -36}, {385, -33} }   // 路線 4 (範例)
            };
            config.towerSlotPositions = {
                {-110, 110}, {-187, 78}, {-101, -14}, {-102, -61}, {-21, -54}, {34, -149}, {120, -73}, {228, -149}
            };
        }
        else if (levelId == 2) {
            config.imagePath = "../PTSD/assets/sprites/images/Map/2.png";
            config.routes = { /* 設定第 2 關的 4 條線 */ };
            config.towerSlotPositions = { {88, 146}, {90, 93} , {-54, 145}, {-105, 26}, {-49, -91}, {27, -73}, {36, -191}};
        }
        else if (levelId == 3) {
            config.imagePath = "../PTSD/assets/sprites/images/Map/3.png";
            config.routes = { /* 設定第 2 關的 4 條線 */ };
            config.towerSlotPositions = { {-26, 205}, {-88, 186},{-21, 96},{51, 110},{129, 115},{114, 13},{-81, -39},{-5, -68}, {67, -92},{225, -165},{-153, -139},{-67, -173}};
        }
        else if (levelId == 4) {
            config.imagePath = "../PTSD/assets/sprites/images/Map/4.png";
            config.routes = { /* 設定第 2 關的 4 條線 */ };
            config.towerSlotPositions = { {-265, -51}, {110, -201},{239, -180}, {-27, -85},{39, -97},{109, -94},{191, -56},{197, 16},{161, 81},{53, 163},{-16, 164},{-86, 152},{-137, 118},{-160, 47},{-137, 1} };
        }
        else if (levelId == 5) {
            config.imagePath = "../PTSD/assets/sprites/images/Map/5.png";
            config.routes = { /* 設定第 2 關的 4 條線 */ };
            config.towerSlotPositions = { {-119, -178},{-165, -43},{-96, 59},{-238, 124},{38, 198},{172, 104}, {216, 67},{5, -33},{6, -82},{134, -35},{120, -80},{114, -137}};
        }


        return std::make_shared<Map>(config);
    }
};

#endif